<?php

namespace Tests\Unit;

use App\Model\PlayerScore;
use PHPUnit\Framework\TestCase;

class PlayerScoreTest extends TestCase
{
    /**
     * 点数の計算
     * @dataProvider getScoreProvider
     * @test
     *
     * @param $hanPoint
     * @param $fuPoint
     * @param $isLeader
     * @param $expect
     * @param $message
     * @return void
     */
    public function calcScore($hanPoint, $fuPoint, $isLeader, $expect, $message)
    {
        $sut = new PlayerScore($hanPoint, $fuPoint, $isLeader);

        $actual = $sut->getScore();

        //アサーションの実行
        $this->assertSame($expect, $actual, $message);
    }

    public function getScoreProvider()
    {
        return [
            //1翻親
            //ピンフツモは1翻ではありえない
            //チートイツは1翻ではありえない
            [1,  30, true, 1500, '点数の計算(1翻親)'],
            [1,  40, true, 2000, '点数の計算(1翻親)'],
            [1,  50, true, 2400, '点数の計算(1翻親)'],
            [1,  60, true, 2900, '点数の計算(1翻親)'],
            [1,  70, true, 3400, '点数の計算(1翻親)'],
            [1,  80, true, 3900, '点数の計算(1翻親)'],
            [1,  90, true, 4400, '点数の計算(1翻親)'],
            [1, 100, true, 4800, '点数の計算(1翻親)'],
            [1, 110, true, 5300, '点数の計算(1翻親)'],
            //2翻
            [2,  20, true,  2000, '点数の計算(2翻親)'],//ピンフツモ
            [2,  25, true,  2400, '点数の計算(2翻親)'],//チートイツ
            [2,  30, true,  2900, '点数の計算(2翻親)'],
            [2,  40, true,  3900, '点数の計算(2翻親)'],
            [2,  50, true,  4800, '点数の計算(2翻親)'],
            [2,  60, true,  5800, '点数の計算(2翻親)'],
            [2,  70, true,  6800, '点数の計算(2翻親)'],
            [2,  80, true,  7700, '点数の計算(2翻親)'],
            [2,  90, true,  8700, '点数の計算(2翻親)'],
            [2, 100, true,  9600, '点数の計算(2翻親)'],
            [2, 110, true, 10600, '点数の計算(2翻親)'],
            //3翻親
            [3,  20, true,  3900, '点数の計算(2翻親)'],//ピンフツモ
            [3,  25, true,  4800, '点数の計算(2翻親)'],//チートイツ
            [3,  30, true,  5800, '点数の計算(3翻親)'],
            [3,  40, true,  7700, '点数の計算(3翻親)'],
            [3,  50, true,  9600, '点数の計算(3翻親)'],
            [3,  60, true, 11600, '点数の計算(3翻親)'],
            [3,  70, true, 12000, '点数の計算(3翻親 符跳)'],
            [3,  80, true, 12000, '点数の計算(3翻親 符跳)'],
            [3,  90, true, 12000, '点数の計算(3翻親 符跳)'],
            [3, 100, true, 12000, '点数の計算(3翻親 符跳)'],
            [3, 110, true, 12000, '点数の計算(3翻親 符跳)'],
            //4翻
            [4,  20, true, 7700, '点数の計算(4翻親)'],//ピンフツモ
            [4,  25, true, 9600, '点数の計算(4翻親)'],//チートイツ
            [4,  30, true, 11600, '点数の計算(4翻親)'],
            [4,  40, true, 12000, '点数の計算(4翻親 符跳)'],
            [4,  50, true, 12000, '点数の計算(4翻親 符跳)'],
            [4,  60, true, 12000, '点数の計算(4翻親 符跳)'],
            [4,  70, true, 12000, '点数の計算(4翻親 符跳)'],
            [4,  80, true, 12000, '点数の計算(4翻親 符跳)'],
            [4,  90, true, 12000, '点数の計算(4翻親 符跳)'],
            [4, 100, true, 12000, '点数の計算(4翻親 符跳)'],
            [4, 110, true, 12000, '点数の計算(4翻親 符跳)'],
            //1翻子
            //ピンフツモは1翻ではありえない
            //チートイツは1翻ではありえない
            [1,  30, false, 1000, '点数の計算(1翻子)'],
            [1,  40, false, 1300, '点数の計算(1翻子)'],
            [1,  50, false, 1600, '点数の計算(1翻子)'],
            [1,  60, false, 2000, '点数の計算(1翻子)'],
            [1,  70, false, 2300, '点数の計算(1翻子)'],
            [1,  80, false, 2600, '点数の計算(1翻子)'],
            [1,  90, false, 2900, '点数の計算(1翻子)'],
            [1, 100, false, 3200, '点数の計算(1翻子)'],
            [1, 110, false, 3600, '点数の計算(1翻子)'],
            //2翻子
            [2,  20, false, 1300, '点数の計算(2翻子)'],//ピンフツモ
            [2,  25, false, 1600, '点数の計算(2翻子)'],//チートイツ
            [2,  30, false, 2000, '点数の計算(2翻子)'],
            [2,  40, false, 2600, '点数の計算(2翻子)'],
            [2,  50, false, 3200, '点数の計算(2翻子)'],
            [2,  60, false, 3900, '点数の計算(2翻子)'],
            [2,  70, false, 4500, '点数の計算(2翻子)'],
            [2,  80, false, 5200, '点数の計算(2翻子)'],
            [2,  90, false, 5800, '点数の計算(2翻子)'],
            [2, 100, false, 6400, '点数の計算(2翻子)'],
            [2, 110, false, 7100, '点数の計算(2翻子)'],
            //3翻子
            [3,  20, false, 2600, '点数の計算(2翻親)'],//ピンフツモ
            [3,  25, false, 3200, '点数の計算(2翻親)'],//チートイツ
            [3,  30, false, 3900, '点数の計算(3翻子)'],
            [3,  40, false, 5200, '点数の計算(3翻子)'],
            [3,  50, false, 6400, '点数の計算(3翻子)'],
            [3,  60, false, 7700, '点数の計算(3翻子)'],
            [3,  70, false, 8000, '点数の計算(3翻子 符跳)'],
            [3,  80, false, 8000, '点数の計算(3翻子 符跳)'],
            [3,  90, false, 8000, '点数の計算(3翻子 符跳)'],
            [3, 100, false, 8000, '点数の計算(3翻子 符跳)'],
            [3, 110, false, 8000, '点数の計算(3翻子 符跳)'],
            //4翻子
            [4,  20, false, 5200, '点数の計算(2翻子)'],//ピンフツモ
            [4,  25, false, 6400, '点数の計算(4翻子)'],//チートイツ
            [4,  30, false, 7700, '点数の計算(4翻子)'],
            [4,  40, false, 8000, '点数の計算(4翻子 符跳)'],
            [4,  50, false, 8000, '点数の計算(4翻子 符跳)'],
            [4,  60, false, 8000, '点数の計算(4翻子 符跳)'],
            [4,  70, false, 8000, '点数の計算(4翻子 符跳)'],
            [4,  80, false, 8000, '点数の計算(4翻子 符跳)'],
            [4,  90, false, 8000, '点数の計算(4翻子 符跳)'],
            [4, 100, false, 8000, '点数の計算(4翻子 符跳)'],
            [4, 110, false, 8000, '点数の計算(4翻子 符跳)'],
            //親満貫
            [5, 0, true, 12000, '点数の計算(親満貫)'],
            //親跳貫
            [6, 0, true, 18000, '点数の計算(親跳貫)'],
            [7, 0, true, 18000, '点数の計算(親跳貫)'],
            //親倍貫
            [8,  0, true, 24000, '点数の計算(親倍貫)'],
            [9,  0, true, 24000, '点数の計算(親倍貫)'],
            [10, 0, true, 24000, '点数の計算(親倍貫)'],
            //親三倍貫
            [11, 0, true, 36000, '点数の計算(親倍貫)'],
            [12, 0, true, 36000, '点数の計算(親倍貫)'],
            //親数え役満
            [13, 0, true, 48000, '点数の計算(親倍貫)'],
            //子満貫
            [5, 0, false, 8000, '点数の計算(親満貫)'],
            //子跳貫
            [6, 0, false, 12000, '点数の計算(親跳貫)'],
            [7, 0, false, 12000, '点数の計算(親跳貫)'],
            //子倍貫
            [8,  0, false, 16000, '点数の計算(親倍貫)'],
            [9,  0, false, 16000, '点数の計算(親倍貫)'],
            [10, 0, false, 16000, '点数の計算(親倍貫)'],
            //子三倍貫
            [11, 0, false, 24000, '点数の計算(親倍貫)'],
            [12, 0, false, 24000, '点数の計算(親倍貫)'],
            //子数え役満
            [13, 0, false, 32000, '点数の計算(親倍貫)'],
        ];
    }
}
